NaN (Not a number)
None (For object data type)

isnull()

True - NaN is missing

False - value is present

In [1]:
import pandas as pd

In [2]:
data = {
    "Name": ["Amit", "Sita", None, "Priya", "Vikram", None, "Rohan", "Kiran", "Meera"],
    "Age": [25, 30, 28,None, 40, 29, 32, 26, 31],
    "Salary": [50000, 60000, 55000, None, 80000, 52000, 70000, None, 65000],
    "Performance": ["Good", "Excellent", None, "Excellent", "Good", "Average", "Good", "Poor", "Excellent"]
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df.isnull()

    Name    Age  Salary  Performance
0  False  False   False        False
1  False  False   False        False
2   True  False   False         True
3  False   True    True        False
4  False  False   False        False
5   True  False   False        False
6  False  False   False        False
7  False  False    True        False
8  False  False   False        False

In [7]:
df.isnull().sum() # it will provide the sum of missing value

Name           2
Age            1
Salary         2
Performance    1
dtype: int64